In [1]:
import sqlite3

In [2]:
database = "student.db"

In [3]:
drop_table = "drop table student"
try:
    with sqlite3.connect(database) as conn:
        cursor=conn.cursor()
        cursor.execute(drop_table)
        conn.commit()
except:
    print("unable to drop the table")

In [4]:
#Creating a table
create_table = "create table student(studentid integer primary key, name text not null, branch text)"

In [5]:
try:
    with sqlite3.connect(database) as conn:
        cursor = conn.cursor()
        cursor.execute(create_table)   
        conn.commit()

except sqlite3.OperationalError as e:
    print(e)

In [6]:
try:
    with sqlite3.connect(database) as conn:
        cursor = conn.cursor()
        cursor.execute("insert into student values(101,'Ram','CS')")
        cursor.execute("insert into student values(102,'Mohan','IS')")
        cursor.execute("insert into student values(103,'Priya','IS')")
        cursor.execute("insert into student values(104,'Surya','EC')")
        conn.commit()
except sqlite3.OperationalError as e:
    print(e)

In [7]:
sqliteConnection = sqlite3.connect('student.db')

In [8]:
cursor = sqliteConnection.cursor()

In [9]:
cursor.execute("Select * from student")

In [10]:
data = cursor.fetchall()
print(data)

[(101, 'Ram', 'CS'), (102, 'Mohan', 'IS'), (103, 'Priya', 'IS'), (104, 'Surya', 'EC')]

In [11]:
cursor = sqliteConnection.cursor()
cursor.execute("Select * from student")
data = cursor.fetchone()
print(data)

(101, 'Ram', 'CS')

In [ ]:
#Load the data to a dataframe object

In [13]:
import pandas as pd

In [14]:
database = "student.db"
conn = sqlite3.connect(database)

In [15]:
df = pd.read_sql_query("SELECT * FROM student", conn)

In [16]:
df

   studentid   name branch
0        101    Ram     CS
1        102  Mohan     IS
2        103  Priya     IS
3        104  Surya     EC

In [17]:
data = pd.read_csv("employees_attrition.csv")

In [18]:
data.shape

(1470, 35)

In [19]:
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,1,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,0,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [20]:
conn = sqlite3.connect('attrition.db')
data.to_sql('emp_attr', conn, if_exists='replace', index=False)

1470

In [21]:
pd.read_sql('select * from emp_attr limit 10', conn)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,1,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,0,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
5,32,0,Travel_Frequently,1005,Research & Development,2,2,Life Sciences,1,8,...,3,80,0,8,2,2,7,7,3,6
6,59,0,Travel_Rarely,1324,Research & Development,3,3,Medical,1,10,...,1,80,3,12,3,2,1,0,0,0
7,30,0,Travel_Rarely,1358,Research & Development,24,1,Life Sciences,1,11,...,2,80,1,1,2,3,1,0,0,0
8,38,0,Travel_Frequently,216,Research & Development,23,3,Life Sciences,1,12,...,2,80,0,10,2,3,9,7,1,8
9,36,0,Travel_Rarely,1299,Research & Development,27,3,Medical,1,13,...,2,80,2,17,3,2,7,7,7,7

In [22]:
pd.read_sql('select count(*) as "No of Records" from emp_attr', conn)

   No of Records
0           1470

In [23]:
query = 'select Department,count(*) as "No of emp", sum(dailyrate) as "total daily rate" from emp_attr group by Department order by 2 desc'

In [24]:
pd.read_sql(query, conn)

               Department  No of emp  total daily rate
0  Research & Development        961            775384
1                   Sales        446            356923
2         Human Resources         63             47347

In [ ]:
# Department wise total attrition

In [47]:
query = 'select Department,sum(attrition) as "Total attrition" from emp_attr group by Department order by 2 desc'

In [51]:
out1 = pd.read_sql(query, conn)
out1

               Department  Total attrition
0  Research & Development              133
1                   Sales               92
2         Human Resources               12

In [ ]:
#Get the max total attrition

In [57]:
out1.max()

Department         Sales
Total attrition      133
dtype: object

In [55]:
out1['Total attrition'].max()

133

In [ ]:
#Business travel wise total attrition

In [59]:
query = 'select BusinessTravel,sum(attrition) as "Total attrition" from emp_attr group by BusinessTravel order by 2 desc'

In [61]:
out = pd.read_sql(query, conn)
out

      BusinessTravel  Total attrition
0      Travel_Rarely              156
1  Travel_Frequently               69
2         Non-Travel               12

In [63]:
out.max()

BusinessTravel     Travel_Rarely
Total attrition              156
dtype: object